alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/include/rtl8721d_usi.h
/**
  ******************************************************************************
  * @file    rtl8721d_usi.h
  * @author
  * @version V1.0.0
  * @date    2017-09-26
  * @brief   This file contains all the functions prototypes for the USI firmware
  *          library.
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#ifndef _RTL8721D_USI_H_
#define _RTL8721D_USI_H_

/** @addtogroup AmebaD_Periph_Driver
  * @{
  */

/* Registers Definitions --------------------------------------------------------*/
/**************************************************************************//**
 * @defgroup USI_Register_Definitions USI Register Definitions
 * @{
 *****************************************************************************/
 
/**************************************************************************//**
 * @defgroup USI_MODE_CTRL
 * @{
 *****************************************************************************/
#define USI_SERIAL_MODE						((u32)0x00000007)	     		/*BIT[2:0], USI serial mode control*/
#define USI_SERIAL_ALL_MODE_DISABLE			((u32)0x00000000)	     		/*BIT[2:0] = 000B, USI all serial mode disable*/
#define USI_SERIAL_UART_MODE				((u32)0x00000001)	     		/*BIT[2:0] = 001B, USI serial UART mode*/
#define USI_SERIAL_SPI_MODE					((u32)0x00000002)	     		/*BIT[2:0] = 010B, USI serial SPI mode*/
#define USI_SERIAL_I2C_MODE					((u32)0x00000004)	     		/*BIT[2:0] = 100B, USI serial I2C mode*/
#define USI_TX_BIT_SWAP						((u32)0x00000010)	     		/*BIT[4], USI TX bit swap */
#define USI_RX_BIT_SWAP						((u32)0x00000020)	     		/*BIT[5], USI RX bit swap */
#define USI_TX_BYTE_SWAP					((u32)0x00000040)	     		/*BIT[6], USI tx byte swap */
#define USI_RX_BYTE_SWAP					((u32)0x00000080)	     		/*BIT[7], USI rx byte swap */

/** @} */

/**************************************************************************//**
 * @defgroup SW_RESET
 * @{
 *****************************************************************************/
#define USI_SW_RESET_RSTB					((u32)0x00000001)	     		/*BIT[0], USI reset/release all logic*/
#define USI_SW_RESET_TX_RSTB				((u32)0x00000002)	     		/*BIT[1], USI reset TX path*/
#define USI_SW_RESET_RX_RSTB				((u32)0x00000004)	     		/*BIT[2], USI reset RX path*/
#define USI_SW_RESET_TXFIFO_RSTB			((u32)0x00000008)	     		/*BIT[3], USI reset tx FIFO*/
#define USI_SW_RESET_RXFIFO_RSTB			((u32)0x00000010)	     		/*BIT[4], USI reset rx FIFO*/

/** @} */

/**************************************************************************//**
 * @defgroup DMA_ENABLE
 * @{
 *****************************************************************************/
#define USI_TX_DMA_ENABLE					((u32)0x00000001)	     		/*BIT[0], USI tx path enable*/
#define USI_RX_DMA_ENABLE					((u32)0x00000002)	     		/*BIT[1], USI rx path enable*/

/** @} */

/**************************************************************************//**
 * @defgroup DMA_REQ_SIZE
 * @{
 *****************************************************************************/
#define USI_TX_DMA_BURST_SIZE				((u32)0x0000007F)	     		/*BIT[6:0], TX DMA burst size*/
#define USI_TX_DMA_SINGLE_SIZE				((u32)0x00007F00)	     		/*BIT[14:8], TX DMA single size*/
#define USI_RX_DMA_BURST_SIZE				((u32)0x007F0000)	     		/*BIT[22:16], RX DMA burst size*/
#define USI_RX_DMA_SINGLE_SIZE				((u32)0x7F000000)	     		/*BIT[30:24], RX DMA single size*/

/** @} */

/**************************************************************************//**
 * @defgroup TX_FIFO_WRITE
 * @{
 *****************************************************************************/
#define USI_TX_FIFO_WRITE_DATA				((u32)0x0000FFFF)	     		/*BIT[15:0], TX FIFO WRITE DATA mask*/
#define USI_TX_FIFO_DATA						((u32)0x000000FF)	     		/*BIT[7:0], TX DATA*/
#define USI_TX_FIFO_CMD_RW					((u32)0x00000001<<8)	   	/*BIT[8], this bit controls whether a read or write is performed*/
#define USI_TX_FIFO_CMD_STOP				((u32)0x00000001<<9)	   	/*BIT[9], this bit controls whether a STOP is issued after the byte is sent or received*/
#define USI_TX_FIFO_CMD_RESTART				((u32)0x00000001<<10)	   	/*BIT[10], this bit controls whether a RESTART is issued after the byte is sent or received*/
#define USI_TX_FIFO_NULL_DATA				((u32)0x00000001<<11)	   	/*BIT[11], NULL_DATA condition*/


/** @} */

/**************************************************************************//**
 * @defgroup TX_FIFO_CTRL
 * @{
 *****************************************************************************/
#define USI_TXFIFO_ALMOST_EMPTY_TH			((u32)0x0000007F)	     		/*BIT[6:0], Tx FIFO almost empty threshold, when Tx FIFO empty space >= 
																		txfifo_almost_empty_th, then txfifo_almost_empty will be "1" and report almost empty*/

/** @} */

/**************************************************************************//**
 * @defgroup TX_FIFO_STATUS
 * @{
 *****************************************************************************/
#define USI_TXFIFO_FULL						((u32)0x00000001)	     		/*BIT[0], TX FIFO FULL status*/
#define USI_TXFIFO_EMPTY					((u32)0x00000001<<1)	     	/*BIT[1], TX FIFO EMPTY status*/
#define USI_TXFIFO_ALMOST_EMPTY_COPY		((u32)0x00000001<<2)	     	/*BIT[2], TX FIFO ALMOST EMPTY status*/
#define USI_TXFIFO_EMPTY_SPACE				((u32)0x0000007F<<8)	     	/*BIT[14:8], Tx FIFO empty space(unpush unit number)*/

/** @} */

/**************************************************************************//**
 * @defgroup RX_FIFO_READ
 * @{
 *****************************************************************************/
#define USI_RX_FIFO_RD_DATA					((u32)0x0000FFFF)	     		/*BIT[15:0], read RX FIFO DATA mask*/
#define USI_RX_FIFO_DATA					((u32)0x000000FF)	     		/*BIT[7:0], TX DATA*/
#define USI_RX_FIFO_PARITY_ERR				((u32)0x00000001<<8)	   	/*BIT[8], parity error status  in current character*/
#define USI_RX_FIFO_STOP_ERR				((u32)0x00000001<<9)	   	/*BIT[9], stop error status in current character*/
#define USI_RX_FIFO_BREAK_FLAG				((u32)0x00000001<<10)	   	/*BIT[10], break event status in current character*/

/** @} */

/**************************************************************************//**
 * @defgroup TX_FIFO_CTRL
 * @{
 *****************************************************************************/
#define USI_RXFIFO_ALMOST_FULL_TH			((u32)0x0000007F)	     		/*BIT[6:0], Rx FIFO almost full threshold, when Rx FIFO valid cnt >= 
																	    rxfifo_almost_full_th, then rxfifo_almost_full will be "1" and report almost full*/

/** @} */

/**************************************************************************//**
 * @defgroup RX_FIFO_STATUS
 * @{
 *****************************************************************************/
#define USI_RXFIFO_FULL						((u32)0x00000001)	     		/*BIT[0], RX FIFO FULL status*/
#define USI_RXFIFO_EMPTY					((u32)0x00000001<<1)	     	/*BIT[1], RX FIFO EMPTY status*/
#define USI_RXFIFO_ALMOST_FULL_COPY		((u32)0x00000001<<2)	     	/*BIT[2], RX FIFO ALMOST FULL status*/
#define USI_RXFIFO_VALID_CNT				((u32)0x0000007F<<8)	     	/*BIT[14:8], Rx FIFO valid cnt(pushed unit number which can be read)*/

/** @} */

/**************************************************************************//**
 * @defgroup RX_FIFO_RD_CNT
 * @{
 *****************************************************************************/
#define USI_RX_FIFO_RD_CNT					((u32)0x0000FFFF)	     		/*BIT[15:0], mask for counting  the byte number of data read from Rx FIFO*/
#define USI_RX_FIFO_RD_CNT_CLR				((u32)0x00010000)	     		/*BIT[16], write 1 to clear rxfifo_rd_cnt*/

/** @} */

/**************************************************************************//**
 * @defgroup INTERRUPT_ENABLE
 * @{
 *****************************************************************************/
#define USI_TXFIFO_ALMOST_EMTY_INTR_EN		((u32)0x00000001)	     		/*BIT[0], txfifo_almost_empty_intr_en*/
#define USI_TXFIFO_OVERFLOW_INTR_EN		((u32)0x00000001<<1)	     	/*BIT[1], txfifo_overflow_intr_en*/
#define USI_TXFIFO_UNDERFLOW_INTR_EN		((u32)0x00000001<<2)	     	/*BIT[2], txfifo_underflow_intr_en*/
#define USI_RXFIFO_ALMOST_FULL_INTR_EN		((u32)0x00000001<<4)	     	/*BIT[4], rxfifo_almost_full_intr_en*/
#define USI_RXFIFO_OVERFLOW_INTR_EN		((u32)0x00000001<<5)	     	/*BIT[5], rxfifo_overflow_intr_en*/
#define USI_RXFIFO_UNDERFLOW_INTR_EN		((u32)0x00000001<<6)	     	/*BIT[6], rxfifo_underflow_intr_en*/
#define USI_RX_PARITY_ERR_INTR_EN			((u32)0x00000001<<8)	     	/*BIT[8], uart_rx_parity_err_intr_en*/
#define USI_RX_STOP_ERR_INTR_EN				((u32)0x00000001<<9)	     	/*BIT[9], uart_rx_stop_err_intr_en*/
#define USI_RX_BREAK_INTR_EN				((u32)0x00000001<<10)	     	/*BIT[10], uart_rx_break_intr_en*/
#define USI_RXFIFO_TM_OUT_INTR_EN			((u32)0x00000001<<11)	     	/*BIT[11], uart_rxfifo_timeout_intr_en*/
#define USI_RX_BAUDMON_DONE_INTR_EN		((u32)0x00000001<<12)	     	/*BIT[12], uart_rx_baudmon_done_intr_en*/
#define USI_TX_CTS_CHANGE_INTR_EN			((u32)0x00000001<<13)	     	/*BIT[13], uart_tx_cts_change_intr_en*/
#define USI_SPI_RX_DATA_FRM_ERR_INTER_EN	((u32)0x00000001<<16)	     	/*BIT[16], spi_rx_data_frame_err_intr_en*/
#define USI_I2C_RD_REQ_INTER_EN				((u32)0x00000001<<20)	     	/*BIT[20], i2c_rd_req_intr_en*/
#define USI_I2C_TX_ABRT_INTER_EN			((u32)0x00000001<<21)	     	/*BIT[21], i2c_tx_abrt_intr_en*/
#define USI_I2C_RX_DONE_INTER_EN			((u32)0x00000001<<22)	     	/*BIT[22], i2c_rx_done_intr_en*/
#define USI_I2C_ACTIVITY_INTER_EN			((u32)0x00000001<<23)	     	/*BIT[23], i2c_activity_intr_en*/
#define USI_I2C_STOP_DET_INTER_EN			((u32)0x00000001<<24)	     	/*BIT[24], i2c_stop_det_intr_en*/
#define USI_I2C_START_DET_INTER_EN			((u32)0x00000001<<25)	     	/*BIT[25], i2c_stop_det_intr_en*/
#define USI_I2C_GEN_CALL_INTER_EN			((u32)0x00000001<<26)	     	/*BIT[26], i2c_gen_call_intr_en*/
#define USI_I2C_LP_WAKE_INTER_EN			((u32)0x00000001<<27)	     	/*BIT[27], i2c_lp_wake_intr_en*/
#define USI_I2C_DMA_DONE_INTER_EN			((u32)0x00000001<<28)	     	/*BIT[28], i2c_dma_done_intr_en*/

/** @} */

/**************************************************************************//**
 * @defgroup INTERRUPT_STATUS
 * @{
 *****************************************************************************/
#define USI_TXFIFO_ALMOST_EMTY_INTS	((u32)0x00000001)	     		/*BIT[0], txfifo_almost_empty_intr*/
#define USI_TXFIFO_OVERFLOW_INTS		((u32)0x00000001<<1)	     	/*BIT[1], txfifo_overflow_intr*/
#define USI_TXFIFO_UNDERFLOW_INTS		((u32)0x00000001<<2)	     	/*BIT[2], txfifo_underflow_intr*/
#define USI_RXFIFO_ALMOST_FULL_INTS	((u32)0x00000001<<4)	     	/*BIT[4], rxfifo_almost_full_intr*/
#define USI_RXFIFO_OVERFLOW_INTS		((u32)0x00000001<<5)	     	/*BIT[5], rxfifo_overflow_intr*/
#define USI_RXFIFO_UNDERFLOW_INTS		((u32)0x00000001<<6)	     	/*BIT[6], rxfifo_underflow_intr*/
#define USI_RX_PARITY_ERR_INTS			((u32)0x00000001<<8)	     	/*BIT[8], uart_rx_parity_err_intr*/
#define USI_RX_STOP_ERR_INTS			((u32)0x00000001<<9)	     	/*BIT[9], uart_rx_stop_err_intr*/
#define USI_RX_BREAK_INTS				((u32)0x00000001<<10)	     	/*BIT[10], uart_rx_break_intr*/
#define USI_RXFIFO_TM_OUT_INTS			((u32)0x00000001<<11)	     	/*BIT[11], uart_rxfifo_timeout_intr*/
#define USI_RX_BAUDMON_DONE_INTS		((u32)0x00000001<<12)	     	/*BIT[12], uart_rx_baudmon_done_intr*/
#define USI_TX_CTS_CHANGE_INTS			((u32)0x00000001<<13)	     	/*BIT[13], uart_tx_cts_change_intr*/
#define USI_SPI_RX_DATA_FRM_ERR_INTS	((u32)0x00000001<<16)	     	/*BIT[16], spi_rx_data_frame_err_intr*/
#define USI_I2C_RD_REQ_INTS				((u32)0x00000001<<20)	     	/*BIT[20], i2c_rd_req_intr*/
#define USI_I2C_TX_ABRT_INTS				((u32)0x00000001<<21)	     	/*BIT[21], i2c_tx_abrt_intr*/
#define USI_I2C_RX_DONE_INTS			((u32)0x00000001<<22)	     	/*BIT[22], i2c_rx_done_intr*/
#define USI_I2C_ACTIVITY_INTS			((u32)0x00000001<<23)	     	/*BIT[23], i2c_activity_intr*/
#define USI_I2C_STOP_DET_INTS			((u32)0x00000001<<24)	     	/*BIT[24], i2c_stop_det_intr*/
#define USI_I2C_START_DET_INTS			((u32)0x00000001<<25)	     	/*BIT[25], i2c_stop_det_intr*/
#define USI_I2C_GEN_CALL_INTS			((u32)0x00000001<<26)	     	/*BIT[26], i2c_gen_call_intr*/
#define USI_I2C_LP_WAKE_INTS			((u32)0x00000001<<27)	     	/*BIT[27], i2c_lp_wake_intr*/
#define USI_I2C_DMA_DONE_INTS			((u32)0x00000001<<28)	     	/*BIT[28], i2c_dma_done_intr*/

/** @} */

/**************************************************************************//**
 * @defgroup INTERRUPT_RAW_STATUS
 * @{
 *****************************************************************************/
#define USI_TXFIFO_ALMOST_EMTY_RSTS	((u32)0x00000001)	     		/*BIT[0], txfifo_almost_empty*/
#define USI_TXFIFO_OVERFLOW_RSTS		((u32)0x00000001<<1)	     	/*BIT[1], txfifo_overflow*/
#define USI_TXFIFO_UNDERFLOW_RSTS		((u32)0x00000001<<2)	     	/*BIT[2], txfifo_underflow*/
#define USI_RXFIFO_ALMOST_FULL_RSTS	((u32)0x00000001<<4)	     	/*BIT[4], rxfifo_almost_full*/
#define USI_RXFIFO_OVERFLOW_RSTS		((u32)0x00000001<<5)	     	/*BIT[5], rxfifo_overflow*/
#define USI_RXFIFO_UNDERFLOW_RSTS		((u32)0x00000001<<6)	     	/*BIT[6], rxfifo_underflow*/
#define USI_RX_PARITY_ERR_RSTS			((u32)0x00000001<<8)	     	/*BIT[8], uart_rx_parity_err*/
#define USI_RX_STOP_ERR_RSTS			((u32)0x00000001<<9)	     	/*BIT[9], uart_rx_stop_err*/
#define USI_RX_BREAK_RSTS				((u32)0x00000001<<10)	     	/*BIT[10], uart_rx_break_intr*/
#define USI_RXFIFO_TM_OUT_RSTS			((u32)0x00000001<<11)	     	/*BIT[11], uart_rxfifo_timeout*/
#define USI_RX_BAUDMON_DONE_RSTS		((u32)0x00000001<<12)	     	/*BIT[12], uart_rx_baudmon_done*/
#define USI_TX_CTS_CHANGE_RSTS			((u32)0x00000001<<13)	     	/*BIT[13], uart_tx_cts_change*/
#define USI_SPI_RX_DATA_FRM_ERR_RSTS	((u32)0x00000001<<16)	     	/*BIT[16], spi_rx_data_frame_err*/
#define USI_I2C_RD_REQ_RSTS				((u32)0x00000001<<20)	     	/*BIT[20], i2c_rd_req*/
#define USI_I2C_TX_ABRT_RSTS			((u32)0x00000001<<21)	     	/*BIT[21], i2c_tx_abrt*/
#define USI_I2C_RX_DONE_RSTS			((u32)0x00000001<<22)	     	/*BIT[22], i2c_rx_done*/
#define USI_I2C_ACTIVITY_RSTS			((u32)0x00000001<<23)	     	/*BIT[23], i2c_activity*/
#define USI_I2C_STOP_DET_RSTS			((u32)0x00000001<<24)	     	/*BIT[24], i2c_stop_det*/
#define USI_I2C_START_DET_RSTS			((u32)0x00000001<<25)	     	/*BIT[25], i2c_stop_det*/
#define USI_I2C_GEN_CALL_RSTS			((u32)0x00000001<<26)	     	/*BIT[26], i2c_gen_call*/
#define USI_I2C_LP_WAKE_RSTS			((u32)0x00000001<<27)	     	/*BIT[27], i2c_lp_wake*/
#define USI_I2C_DMA_DONE_RSTS			((u32)0x00000001<<28)	     	/*BIT[28], i2c_dma_done*/

/** @} */

/**************************************************************************//**
 * @defgroup I2C_TX_ABRT_SOURCE
 * @{
 *****************************************************************************/
#define USI_I2C_ABRT_7B_ADDR_NOACK		((u32)0x00000001)	     		/*BIT[0], Master is in 7-bit addressing mode and the address sent was 
																    		not acknowledged by any slave. Role is Master*/
#define USI_I2C_ABRT_10ADDR1_NOACK		((u32)0x00000001<<1)	     	/*BIT[1], Master is in 10-bit address mode and the first 10-bit address 
																		byte was not acknowledged by any slave. Role is Master.*/
#define USI_I2C_ABRT_10ADDR2_NOACK		((u32)0x00000001<<2)	     	/*BIT[2], Master is in 10-bit address mode and the second byte of the 
																		10-bit address was not acknowledged by any slave. Role is Master.*/
#define USI_I2C_ABRT_TXDATA_NOACK		((u32)0x00000001<<3)	     	/*BIT[3], This is a master-mode only bit. Master has received an acknowledgement
																		for the address, but when it sent data byte(s) following the address, it did not
																		receive an acknowledge from the remote slave(s). Role is Master-Transmitter.*/
#define USI_I2C_ABRT_GCALL_NOACK		((u32)0x00000001<<4)	     	/*BIT[4], I2C in master mode sent a General Call and no slave on the bus acknowledged 
																		the General Call. Role is Master-Transmitter.*/
#define USI_I2C_ABRT_GCALL_READ			((u32)0x00000001<<5)	     	/*BIT[5], I2C in master mode sent a General Call but the user programmed the byte following
																		the General Call to be a read from the bus. Role is Master-Transmitter.*/
#define USI_I2C_ABRT_HS_ACKDET			((u32)0x00000001<<6)	     	/*BIT[6], Master is in High Speed mode and the High Speed Master code was acknowledged 
																		(wrong behavior). Role is Master.*/
#define USI_I2C_ABRT_SBYTE_ACKDET		((u32)0x00000001<<7)	     	/*BIT[7], Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).
																		Role is Master.*/
#define USI_I2C_ABRT_HS_NORSTRT		((u32)0x00000001<<8)	     	/*BIT[8], The restart is disabled and the user is trying to use the master to transfer data in High 
																		Speed mode. Role is Master.*/
#define USI_I2C_ABRT_SBYTE_NORSTRT		((u32)0x00000001<<9)	     	/*BIT[9], The restart is disabled and the user is trying to send a START Byte. Role is Master.*/
#define USI_I2C_ABRT_10B_RD_NORSTRT	((u32)0x00000001<<10)	     	/*BIT[10], The restart is disabled and the master sends a read command in 10-bit addressing mode. 
																		Role is Master-Receiver.*/
#define USI_I2C_ABRT_MASTER_DIS			((u32)0x00000001<<11)	     	/*BIT[11], User tries to initiate a Master operation with the Master mode disabled. Role is Master.*/
#define USI_I2C_ARBT_LOST				((u32)0x00000001<<12)	     	/*BIT[12], Master has lost arbitration, or if i2c_tx_abrt_source [14] is also set, then the slave transmitter
																		has lost arbitration. Role is Master-Transmitter or Slave-Transmitter.*/
#define USI_I2C_ABRT_SLVFLUSH_TXFIFO	((u32)0x00000001<<13)	     	/*BIT[13], Slave has received a read command and some data exists in the TxFIFO so the slave issues a 
																		  TX_ABRT interrupt to flush old data in TxFIFO. Role is Slave-Transmitter*/
#define USI_I2C_ABRT_SLV_ARBLOST		((u32)0x00000001<<14)	     	/*BIT[14], Slave lost the bus while transmitting data to a remote master. i2c_tx_abrt_source [12] is set 
																		  at the same time. Role is Slave-Transmitter.*/
/** @} */

/**************************************************************************//**
 * @defgroup INTERRUPT_ALL_CLR
 * @{
 *****************************************************************************/
#define USI_INT_ALL_CLEAR				((u32)0x00000001)	     		/*BIT[0], Write "1" to this register to clear the combined interrupt, all individual interrupts, interrupt 
																		status register and raw interrupt status register. This bit does not clear hardware clearable 
																		interrupts but software dis-clearable interrupts, and the relate register (include txfifo_almost_empty, 
																		rxfifo_almost_full, uart_rxfifo_timeout)*/

/** @} */

/**************************************************************************//**
 * @defgroup INTERRUPT_STATUS_CLR
 * @{
 *****************************************************************************/
#define USI_TXFIFO_OVERFLOW_CLR		((u32)0x00000001<<1)	     	/*BIT[1], clear txfifo_overflow interrupt and related register*/
#define USI_TXFIFO_UNDERFLOW_CLR		((u32)0x00000001<<2)	     	/*BIT[2], clear txfifo_underflow interrupt and related register*/
#define USI_RXFIFO_OVERFLOW_CLR		((u32)0x00000001<<5)	     	/*BIT[5], clear rxfifo_overflow interrupt and related register*/
#define USI_RXFIFO_UNDERFLOW_CLR		((u32)0x00000001<<6)	     	/*BIT[6], clear rxfifo_underflow interrupt and related register*/
#define USI_RX_PARITY_ERR_CLR			((u32)0x00000001<<8)	     	/*BIT[8], clear uart_rx_parity_err interrupt and related register*/
#define USI_RX_STOP_ERR_CLR				((u32)0x00000001<<9)	     	/*BIT[9], clear uart_rx_stop_err interrupt and related register*/
#define USI_RX_BREAK_CLR				((u32)0x00000001<<10)	     	/*BIT[10], clear uart_rx_break interrupt and related register*/
#define USI_RX_BAUDMON_DONE_CLR		((u32)0x00000001<<12)	     	/*BIT[12], clear uart_rx_baudmon_done interrupt and related register*/
#define USI_TX_CTS_CHANGE_CLR			((u32)0x00000001<<13)	     	/*BIT[13], clear uart_tx_cts_change interrupt and related register*/
#define USI_SPI_RX_DATA_FRM_ERR_CLR	((u32)0x00000001<<16)	     	/*BIT[16], clear spi_rx_data_frame_err interrupt and related register*/
#define USI_I2C_RD_REQ_CLR				((u32)0x00000001<<20)	     	/*BIT[20], clear i2c_rd_req interrupt and related register*/
#define USI_I2C_TX_ABRT_CLR				((u32)0x00000001<<21)	     	/*BIT[21], clear i2c_tx_abrt interrupt and related register, this is also releases
																		the Tx FIFO from the flushed/reset state, allowing more writes to the Tx FIFO.*/
#define USI_I2C_RX_DONE_CLR				((u32)0x00000001<<22)	     	/*BIT[22], clear i2c_rx_done interrupt and related register*/
#define USI_I2C_ACTIVITY_CLR				((u32)0x00000001<<23)	     	/*BIT[23], clear i2c_activity interrupt and related register if the I2C is not active anymore. If the
																		I2C module is still active on the bus, the i2c_activity will continues to be set. It is automatically 
																		cleared by hardware if the module is disabled and if there is no further activity on the bus. */
#define USI_I2C_STOP_DET_CLR			((u32)0x00000001<<24)	     	/*BIT[24], clear i2c_stop_det interrupt and related register*/
#define USI_I2C_START_DET_CLR			((u32)0x00000001<<25)	     	/*BIT[25], clear i2c_start_det interrupt and related register*/
#define USI_I2C_GEN_CALL_CLR			((u32)0x00000001<<26)	     	/*BIT[26], clear i2c_gen_call interrupt and related register*/
#define USI_I2C_LP_WAKE_CLR				((u32)0x00000001<<27)	     	/*BIT[27], clear i2c_lp_wake interrupt and related register*/
#define USI_I2C_DMA_DONE_CLR			((u32)0x00000001<<28)	     	/*BIT[28], clear i2c_dma_done interrupt and related register*/

/** @} */

